/*
  Задание 1

  Установка пакетов через npm и запуск тестового приложения.

  1.  Установите Node.js под вашу систему с офф. сайта: https://nodejs.org/uk/
    Если node у вас уже установлен этот пункт можете пропустить.
    Проверить наличие node.js у вас в системе можно проверить командой node -v / npm -v

  2. 	Инициализируйте пустой проект в вашей рабочей директории
  3.	Через npm или yarn установите следующий список зависимостей:

    - express
    - gulp
    - normalize.css
    - jQuery

  4. 	Через командную строку запустите сервер express используя Hello-world заготовку:
    http://expressjs.com/en/starter/hello-world.html
    node yourscriptname.js

*/
